<template>
  <div class="main-container">
    <!-- 类别条幅头 -->
    <div class="zib-widget active" :class="{'box-after':isMouseState}"
     @mouseenter="setMouseState(true)"
     @mouseleave="setMouseState(false)"
     >
      <div class="box" :class="{ 'mouse-enter': isMouseState }">
        <div class="title-h-left">
          <svg t="1716984731311" :class="[isNight?'svg-night':'svg-day']" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="6979"><path d="M81.188571 412.086857L0 709.632V138.678857a53.394286 53.394286 0 0 1 53.394286-53.394286h253.366857c14.116571 0 27.721143 5.632 37.668571 15.652572l109.275429 109.275428a10.605714 10.605714 0 0 0 7.533714 3.145143h381.44a53.394286 53.394286 0 0 1 53.321143 53.321143v74.605714H173.787429a96.182857 96.182857 0 0 0-92.598858 70.802286z m921.965715-7.094857a52.955429 52.955429 0 0 0-42.422857-20.992H173.787429a53.394286 53.394286 0 0 0-51.419429 39.350857L11.776 828.635429a53.394286 53.394286 0 0 0 51.419429 67.364571h787.017142a53.394286 53.394286 0 0 0 51.492572-39.350857l110.518857-405.284572a52.955429 52.955429 0 0 0-9.069714-46.372571z" p-id="6980"></path></svg>
        </div>
        <div 
        :class="{
          'font-night-leave': isNight && !isMouseState,
          'font-day-leave': !isNight && !isMouseState,
          'font-day-enter': !isNight && isMouseState,
          'font-night-enter':isNight && isMouseState
          }"
        >{{ menuItems[currentActiveIndex].label }}/共2367篇</div>
      </div>

    </div>
    <!-- 书籍文章列表 -->
    <div class="book-list">
      <!-- 一个书籍小盒子 -->
      <div class="book-row"
        @mouseenter="changeImageState(item.id,true)"
        @mouseleave="changeImageState(item.id,false)"
        v-for="item in bookItems" :key="item.id"
      >
        <!-- 标题 -->
        <h2 class="item-heading">
          <a href="#"
          @mouseenter="changeTitleState(item.id,true)"
          @mouseleave="changeTitleState(item.id,false)"
          :class="[itemStates[item.id]?.isTitleState?'title-enter':'title-leave']"
          ><strong>{{ item.title }}</strong></a>
        </h2>
        <!-- 书籍其他信息，图片介绍等等:需要flex布局-->
        <div class="flex">
          <!-- 图片 -->
          <div class="book-image-container">
            <div class="book-image">
              <a href="#">
                <img :src="item.imgSrc" alt=""
                  :class="[itemStates[item.id]?.isImageState?'image-enter':'image-leave']"
                >
              </a>
            </div>
          </div>
          <!-- 介绍等信息 ：不需要flex或者flex-direction：column-->
          <div class="book-body">
            <!-- 介绍 -->
            <div class="book-body-content">
              <!-- 直接写入即可无需标签 -->
              {{ item.txt }} {{ item.content }}
            </div>
            <!-- 标签 -->
            <div class="book-body-tags">
              <a href="#"
              @mouseenter="changeTag1State(item.id,true)"
              @mouseleave="changeTag1State(item.id,false)"
              class="but"
              :class="[itemStates[item.id]?.isTag1State?'but1-enter':'but1-leave']"
              >
                <span>付费资源</span>
                <svg t="1717045600296" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="3778"><path d="M228.6 530.5c-45.2-18.9-73.3-43.7-73.3-64.7V326.2c31.1 20.1 73.2 36.7 122 48 48 11.1 101.4 17.1 154.4 17.1s106.4-5.9 154.4-17.1c48.8-11.3 90.9-27.9 122-48v78.1h64.5V227.5c0-49.5-37.7-91.8-109-122.1-62.1-26.5-146.7-41.7-231.8-41.7S262 78.9 199.9 105.4c-71.4 30.3-109 72.6-109 122.1v476.8c0 49.5 37.7 91.8 109 122.1 62.2 26.5 146.7 41.7 231.8 41.7h2v-64.5h-2c-77.4 0-149.6-12.3-203.1-34.6-45.2-18.9-73.3-43.7-73.3-64.7V564.7c31.1 20.2 73.2 36.7 122 48 48 11.1 101.4 17.1 154.4 17.1h2v-64.6h-2c-77.4 0-149.6-12.3-203.1-34.7z m-73.3-303c0-21 28.1-45.8 73.3-64.7 53.5-22.4 125.7-34.6 203.1-34.6s149.6 12.3 203.1 34.6c45.2 18.9 73.3 43.7 73.3 64.7s-28.1 45.8-73.3 64.7c-53.5 22.3-125.6 34.6-203.1 34.6-77.4 0-149.6-12.3-203.1-34.6-45.2-18.9-73.3-43.7-73.3-64.7z" fill="#fff" p-id="3779"></path><path d="M702.6 420.3C551.2 420.3 472 479 472 537.1v306.4c0 58 79.2 116.8 230.6 116.8 69.5 0 128.5-12.3 170.7-35.7 37.1-20.6 58.3-48.2 59.8-77.7h0.1V537c0-58-79.2-116.7-230.6-116.7z m166.1 423.1c0 7.2-14.2 20.3-41.3 31.4-23.3 9.5-63.9 20.9-124.9 20.9S601 884.3 577.7 874.8c-27.1-11-41.3-24.2-41.3-31.4v-69.8c41.9 21.8 99.2 33.3 166.2 33.3s124.3-11.5 166.2-33.3v69.8z m0-153.1c0 7.2-14.2 20.3-41.3 31.4-23.1 9.4-63 20.7-123.2 20.9h-1.7c-61 0-101.6-11.3-124.9-20.9-27.1-11-41.3-24.2-41.3-31.4v-69.9c41.9 21.9 99.2 33.3 166.2 33.3s124.3-11.5 166.2-33.3v69.9z m-41.3-121.9c-23.3 9.5-63.9 20.9-124.9 20.9S601 577.9 577.7 568.4c-27.1-11-41.3-24.2-41.3-31.4 0-7.2 14.2-20.3 41.3-31.4 23.3-9.5 63.9-20.9 124.9-20.9s101.6 11.3 124.9 20.9c27.1 11 41.3 24.2 41.3 31.4-0.1 7.3-14.2 20.3-41.4 31.4z" fill="#fff" p-id="3780"></path></svg>
                <span>{{item.money}}</span>
              </a>
              <a href="#" class="but but2"
              @mouseenter="changeTag2State(item.id,true)"
              @mouseleave="changeTag2State(item.id,false)"
              :class="[itemStates[item.id]?.isTag2State?'but2-enter':'but2-leave']"
              > {{ item.tag1 }}</a>
              <a href="#" class="but but3"
              @mouseenter="changeTag3State(item.id,true)"
              @mouseleave="changeTag3State(item.id,false)"
              :class="[itemStates[item.id]?.isTag3State?'but3-enter':'but3-leave']"
              >{{item.tag2}}</a>
            </div>
            <!-- 头像、时间、评论、浏览量、点赞数:flex -->
            <div class="book-body-other">
                <div class="userAndTime">
                  <!-- 头像+用户名 -->
                  <a href="#" class="avatar-mini">
                    <img :src='item.avatar'  alt=""
                    @mouseenter="changeAvatarState(item.id,true)"
                    @mouseleave="changeAvatarState(item.id,false)"
                    :class="[itemStates[item.id]?.isAvatarState?'avatar-enter':'avatar-leave']"
                    >
                  </a>
                  <span class="name">{{ item.uname }}</span>
                  <!-- 时间 -->
                  <span class="time">{{ item.time }}</span>
                </div>
                <div class="right">
                  <!-- 评论 -->
                  <a href="#">
                    <svg t="1717045165693" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="2548"><path d="M853.333333 768c35.413333 0 64-20.650667 64-55.978667V170.581333A63.978667 63.978667 0 0 0 853.333333 106.666667H170.666667C135.253333 106.666667 106.666667 135.253333 106.666667 170.581333v541.44C106.666667 747.285333 135.338667 768 170.666667 768h201.173333l110.016 117.44a42.752 42.752 0 0 0 60.586667 0.042667L651.904 768H853.333333z m-219.029333-42.666667h-6.250667l-115.797333 129.962667c-0.106667 0.106667-116.010667-129.962667-116.010667-129.962667H170.666667c-11.776 0-21.333333-1.621333-21.333334-13.312V170.581333A21.205333 21.205333 0 0 1 170.666667 149.333333h682.666666c11.776 0 21.333333 9.536 21.333334 21.248v541.44c0 11.754667-9.472 13.312-21.333334 13.312H634.304zM341.333333 490.666667a42.666667 42.666667 0 1 0 0-85.333334 42.666667 42.666667 0 0 0 0 85.333334z m170.666667 0a42.666667 42.666667 0 1 0 0-85.333334 42.666667 42.666667 0 0 0 0 85.333334z m170.666667 0a42.666667 42.666667 0 1 0 0-85.333334 42.666667 42.666667 0 0 0 0 85.333334z" fill="#999999" p-id="2549"></path></svg>
                    <span>{{item.commentsCount}}</span>
                  </a>
                  <!-- 浏览量 -->
                  <a href="#">
                    <svg t="1716998291127" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="9060"><path d="M512 619.789474c-59.284211 0-107.789474-48.505263-107.789474-107.789474s48.505263-107.789474 107.789474-107.789474 107.789474 48.505263 107.789474 107.789474-48.505263 107.789474-107.789474 107.789474z m0-80.842106c16.168421 0 26.947368-10.778947 26.947368-26.947368s-10.778947-26.947368-26.947368-26.947368-26.947368 10.778947-26.947368 26.947368 10.778947 26.947368 26.947368 26.947368z" fill="#999999" p-id="9061"></path><path d="M509.305263 781.473684C231.747368 781.473684 80.842105 512 80.842105 512S234.442105 242.526316 512 242.526316c280.252632 0 431.157895 269.473684 431.157895 269.473684s-153.6 266.778947-433.852632 269.473684c2.694737 0 0 0 0 0z m2.694737-80.842105c167.073684 0 282.947368-123.957895 334.147368-188.631579-48.505263-64.673684-164.378947-188.631579-334.147368-188.631579-167.073684 0-282.947368 123.957895-334.147368 188.631579 48.505263 64.673684 164.378947 188.631579 334.147368 188.631579z" fill="#999999" p-id="9062"></path></svg>
                    <span>{{item.viewsCount}}</span>
                  </a>
                  <!-- 点赞量 -->
                  <a href="#">
                    <svg t="1716998338263" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="10080"><path d="M190.193225 471.411583c14.446014 0 26.139334-11.718903 26.139334-26.13831 0-14.44499-11.69332-26.164916-26.139334-26.164916-0.271176 0-0.490164 0.149403-0.73678 0.149403l-62.496379 0.146333c-1.425466-0.195451-2.90005-0.295735-4.373611-0.295735-19.677155 0-35.621289 16.141632-35.621289 36.114522L86.622358 888.550075c0 19.949354 15.96767 35.597753 35.670407 35.597753 1.916653 0 3.808746 0.292666 5.649674 0l61.022819 0.022513c0.099261 0 0.148379 0.048095 0.24764 0.048095 0.097214 0 0.146333-0.048095 0.24457-0.048095l0.73678 0 0-0.148379c13.413498-0.540306 24.174586-11.422144 24.174586-24.960485 0-13.55983-10.760065-24.441669-24.174586-24.981974l0-0.393973-50.949392 0 1.450025-402.275993L190.193225 471.409536z" fill="#5D5D5D" p-id="10081"></path><path d="M926.52241 433.948343c-19.283182-31.445176-47.339168-44.172035-81.289398-45.546336-1.77032-0.246617-3.536546-0.39295-5.380544-0.39295l-205.447139-0.688685c13.462616-39.059598 22.698978-85.58933 22.698978-129.317251 0-28.349675-3.193739-55.962569-9.041934-82.542948l-0.490164 0.049119c-10.638291-46.578852-51.736315-81.31498-100.966553-81.31498-57.264215 0-95.466282 48.15065-95.466282 106.126063 0 3.241834-0.294712 6.387477 0 9.532097-2.996241 108.386546-91.240027 195.548698-196.23636 207.513194l0 54.881958-0.785899 222.227314 0 229.744521 10.709923 0 500.025271 0.222057 8.746198-0.243547c19.35686 0.049119 30.239721-4.817726 47.803749-16.116049 16.682961-10.761088 29.236881-25.50079 37.490869-42.156122 2.260483-3.341095 4.028757-7.075139 5.106298-11.20111l77.018118-344.324116c1.056052-4.053316 1.348718-8.181333 1.056052-12.160971C943.643346 476.446249 938.781618 453.944769 926.52241 433.948343zM893.82573 486.837924l-82.983993 367.783411-0.099261-0.049119c-2.555196 6.141884-6.879688 11.596106-12.872169 15.427364-4.177136 2.727111-8.773827 4.351098-13.414521 4.964058-1.49812-0.195451-3.046383 0-4.620227 0l-477.028511-0.540306-0.171915-407.408897c89.323375-40.266076 154.841577-79.670527 188.596356-173.661202 0.072655 0.024559 0.124843 0.049119 0.195451 0.072655 2.99931-9.137101 6.313799-20.73423 8.697079-33.164331 5.551436-29.185716 5.258771-58.123792 5.258771-58.123792-4.937452-37.98001 25.940812-52.965306 44.364417-52.965306 25.304316 0.860601 50.263777 33.656541 50.263777 52.326762 0 0 5.600555 27.563776 5.649674 57.190537 0.048095 37.366026-4.6673 56.847729-4.6673 56.847729l-0.466628 0c-5.872754 30.879288-16.214287 60.138682-30.464849 86.964654l0.36839 0.342808c-2.358721 4.815679-3.709485 10.220782-3.709485 15.943111 0 19.922748 19.088754 21.742187 38.765909 21.742187l238.761895 0.270153c0 0 14.666024 0.465604 14.690584 0.465604l0 0.100284c12.132318-0.638543 24.221658 5.207605 31.100322 16.409738 5.504364 9.016351 6.437619 19.6045 3.486404 28.988218L893.82573 486.837924z" fill="#999999" p-id="10082"></path><path d="M264.827039 924.31872c0.319272 0.024559 0.441045 0.024559 0.295735-0.024559 0.243547-0.048095 0.367367-0.074701-0.295735-0.074701s-0.539282 0.026606-0.271176 0.074701C264.43409 924.343279 264.532327 924.343279 264.827039 924.31872z" fill="#999999" p-id="10083"></path></svg>
                    <span>{{item.likesCount}}</span>
                  </a>
                </div>
            </div>
          </div>
        </div>
      </div>
    </div>


    
  </div>
</template>

<script>
export default {
  props: ['currentActiveIndex', 'isNight', 'isVisible', 'menuItems','bookItems'],
  data(){
    return{
      BcurrentActiveIndex: this.currentActiveIndex,
      BisNight: this.isNight,
      BisVisible: this.isVisible,
      BmenuItems: this.menuItems,
      isMouseState:false,
      itemStates: {}
    }
  },
  methods:{
    ensureItemState(id) {
      if (!this.itemStates[id]) {
        this.$set(this.itemStates, id, {
           isImageState: false, 
           isTitleState: false ,
           isTag1State:false,
           isTag2State:false,
           isTag3State:false,
           isAvatarState:false,
          });
      }
    },
    setMouseState(state){
      this.isMouseState=state
    },
    changeImageState(id,state){
      this.ensureItemState(id);
      this.$set(this.itemStates[id], 'isImageState', state);
    },
    changeTag1State(id,state){
      this.ensureItemState(id);
      this.$set(this.itemStates[id], 'isTag1State', state);
      
    },
    changeTag2State(id,state){
      this.ensureItemState(id);
      this.$set(this.itemStates[id], 'isTag2State', state);
    },
    changeTag3State(id,state){
      this.ensureItemState(id);
      this.$set(this.itemStates[id], 'isTag3State', state);
    },
    changeTitleState(id,state){
      this.ensureItemState(id);
      this.$set(this.itemStates[id], 'isTitleState', state);
    },
    changeAvatarState(id,state){
      this.ensureItemState(id);
      this.$set(this.itemStates[id], 'isAvatarState', state);
    }
  }

}
</script>

<style>
  @import '../css/BookBody.css';
</style>